SCENARIOS = {
    "weekend_event": {
        "name": "Выходной день / концентрация у Казанского собора",
        "type": "event",
        "clusters": [
            {"center": [59.935181, 30.325008], "count": 55, "spread": 0.00030},  # у собора
            {"center": [59.934700, 30.326200], "count": 22, "spread": 0.00028},  # перед площадью
            {"center": [59.935500, 30.327300], "count": 20, "spread": 0.00025},  # ближе к метро
            {"center": [59.934100, 30.326900], "count": 18, "spread": 0.00022},  # набережная канала
        ],
        "lines": [
            {
                "start": [59.934900, 30.321600],
                "end": [59.935600, 30.329200],
                "count": 38,
                "spread": 0.00006
            },  # Невский / пешеходный поток
            {
                "start": [59.933900, 30.325300],
                "end": [59.934300, 30.328300],
                "count": 18,
                "spread": 0.00005
            },  # вдоль канала
        ],
        "poi": [
            {"center": [59.935687, 30.327232], "count": 16, "spread": 0.00016},  # метро
            {"center": [59.934048, 30.326970], "count": 12, "spread": 0.00014},  # набережная
        ],
    },

    "weekday_commute": {
        "name": "Будний день / поток по Невскому и к метро",
        "type": "commute",
        "lines": [
            {
                "start": [59.935782, 30.320854],
                "end": [59.935250, 30.331454],
                "count": 70,
                "spread": 0.00005
            },
            {
                "start": [59.934850, 30.322000],
                "end": [59.935450, 30.328700],
                "count": 42,
                "spread": 0.00005
            }, # поток вдоль канала
            {
                "start": [59.935200, 30.324200],
                "end": [59.935800, 30.327500],
                "count": 24
            },  # переток к метро
        ],
        "clusters": [
            {"center": [59.935687, 30.327232], "count": 28, "spread": 0.00018},  # метро
            {"center": [59.935181, 30.325008], "count": 20, "spread": 0.00020},  # у собора
        ],
        "poi": [
            {"center": [59.934048, 30.326970], "count": 10, "spread": 0.00012},  # канал
            {"center": [59.934700, 30.325900], "count": 9, "spread": 0.00012},   # переход / узел
        ],
    },
}